<a href="https://colab.research.google.com/github/julianovale/pythonparatodos/blob/main/M%C3%B3dulo10Aula13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
url_metricas = 'https://raw.githubusercontent.com/julianovale/pythonparatodos/main/ISDEL_Cidades_Estado_SPIBGE.csv'
pd_metricas = pd.read_csv(url_metricas, encoding = 'latin-1', sep = ';', decimal = ',')
pd_metricas

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (1) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

        Cód_Municipio Nome_Municipio   ISDEL
0           3500105.0     Adamantina   0.4285
1           3500204.0         Adolfo   0.3437
2           3500303.0          Aguaí   0.3327
3           3500709.0         Agudos   0.3943
4           3500758.0       Alambari   0.3491
...               ...            ...      ...
971235            NaN            NaN      NaN
971236            NaN            NaN      NaN
971237            NaN            NaN      NaN
971238            NaN            NaN      NaN
971239            NaN            NaN      NaN

[971240 rows x 3 columns]

In [4]:
df = pd_metricas.dropna()
df

     Cód_Municipio      Nome_Municipio   ISDEL
0        3500105.0          Adamantina   0.4285
1        3500204.0              Adolfo   0.3437
2        3500303.0               Aguaí   0.3327
3        3500709.0              Agudos   0.3943
4        3500758.0            Alambari   0.3491
..             ...                 ...      ...
640      3500600.0  Águas de São Pedro   0.4716
641      3501202.0    Álvares Florence   0.3498
642      3501301.0     Álvares Machado   0.3603
643      3501400.0  Álvaro de Carvalho   0.3136
644      3533809.0                Óleo   0.3523

[645 rows x 3 columns]

In [5]:
print(df.columns.ravel())

['Cód_Municipio' 'Nome_Municipio' ' ISDEL ']